package ru.ztech.restclient.wb.impl;

/**
 * WbConfigUrl
 *
 * @since 0.1 (12-01-2022)
 * @author Гончаров Никита 
 * 
 */
public class WbConfigUrl {

    // ~ Статические поля/инициализации =====================================================================
    
    // ~ Переменные(свойства) класса ========================================================================
    
    // ~ Управляемые объекты(Beans) =========================================================================
    
    // ~ Конструктор ========================================================================================
    
    // ~ Методы =============================================================================================
    public String getReportSaleBySales() {
        return "https://suppliers-stats.wildberries.ru/api/v1/supplier/reportDetailByPeriod?dateFrom={dateFrom}&key={key}&limit={limit}&rrdid={rrdid}&dateto={dateTo}";
    }
    
    // ~ Доступ к свойствам =================================================================================
    
}
